package Task_01;

/**
 1. Написать класс MaxBox с полем экземпляра для хранения одного целого числа
 */
public class Demo {
    public static void main(String args[]) {

        MaxBox maxBox = new MaxBox();
        maxBox.value = 128;
        System.out.println(maxBox.value);
    }
}
