package Task_06;

/**
 6. Написать метод класса Rectangle, который будет возвращать площадь прямоугольника
 */
public class Demo {

    public static void main(String args[]) {
        Rectangle myRectangle = new Rectangle(20, 40);
        System.out.println(myRectangle.calculateSquare());
    }
}
